#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.vehicles_app_service.module.vehicles_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [10s elapsed]
module.vehicles_app_service.module.vehicles_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.vehicles_app_service.module.vehicles.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = {
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "AUTH_SECRET"                                     = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "INTEROP_CLIENT_ASSERTION_ISS"                    = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "INTEROP_CLIENT_ASSERTION_KID"                    = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "INTEROP_CLIENT_ASSERTION_PK"                     = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "INTEROP_CLIENT_ASSERTION_PURPOSE_ID"             = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "INTEROP_CLIENT_ASSERTION_SUB"                    = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "INTEROP_CLIENT_ID"                               = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "OIDC_CLIENT_ID"                                  = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "OIDC_CLIENT_SECRET"                              = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "OIDC_MOCK_JWT_PRIVATE_KEY"                       = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "OIDC_MOCK_JWT_PUBLIC_KEY"                        = (sensitive value)
            # (19 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.Web/sites/io-p-itn-ipatente-vehicles-app-01"
        name                                           = "io-p-itn-ipatente-vehicles-app-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-ipatente/infra/prod"
        }
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.vehicles_app_service.module.vehicles.azurerm_linux_web_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_web_app_slot" "this" {
      ~ app_settings                                   = {
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "AUTH_SECRET"                                     = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "INTEROP_CLIENT_ASSERTION_ISS"                    = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "INTEROP_CLIENT_ASSERTION_KID"                    = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "INTEROP_CLIENT_ASSERTION_PK"                     = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "INTEROP_CLIENT_ASSERTION_PURPOSE_ID"             = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "INTEROP_CLIENT_ASSERTION_SUB"                    = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "INTEROP_CLIENT_ID"                               = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "OIDC_CLIENT_ID"                                  = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "OIDC_CLIENT_SECRET"                              = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "OIDC_MOCK_JWT_PRIVATE_KEY"                       = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "OIDC_MOCK_JWT_PUBLIC_KEY"                        = (sensitive value)
            # (19 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.Web/sites/io-p-itn-ipatente-vehicles-app-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-ipatente/infra/prod"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.vehicles_app_service.module.vehicles_app_service_roles.module.key_vault.azurerm_role_assignment.secrets["io-p-itn-ipatente-rg-01|io-p-itn-ipatente-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0075b2ec-fe8b-4e4b-bd03-cefa7bc2beac"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ipatente-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
